benchmark/benchmark-result-2025-12-26/sleep_0ms/no-keep-alive/cl-tbnl-gserver-tmgr_threads-8-default.log
cl-tbnl-gserver-tmgr_threads-8-default.log
CL-TBNL-GSERVER-TMGR	0.1.1

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.0

# -H Connection: close -t 4 -c 100 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.46ms    7.68ms 220.60ms   88.72%
    Req/Sec     2.76k   285.54     3.61k    68.25%
  109994 requests in 10.01s, 17.41MB read
Requests/sec:  10991.42
Transfer/sec:      1.74MB

# -H Connection: close -t 4 -c 10 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01ms  542.11us  16.25ms   92.44%
    Req/Sec     1.83k   210.02     2.16k    77.31%
  73179 requests in 10.10s, 11.58MB read
Requests/sec:   7244.64
Transfer/sec:      1.15MB

# -H Connection: close -t 16 -c 400 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.05ms   28.74ms 314.36ms   75.03%
    Req/Sec   664.74    180.48     1.88k    81.14%
  106843 requests in 10.10s, 16.91MB read
Requests/sec:  10580.69
Transfer/sec:      1.68MB